app/controllers/podcasts_controller.rb

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @podcast = Podcast.find(params[:id])

INSERT INTO "podcasts" ("title", "link", "created_at", "updated_at", "user_id", "days") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Thursday Podcast"], ["link", "thursdaytest.com"], ["created_at", 2017-02-17 00:13:06 UTC], ["updated_at", 2017-02-17 00:13:06 UTC], ["user_id", 6], ["days", "Thursday"]]
---
  def create
    @user = current_user
    @podcast = Podcast.new(params.require(:podcast).permit(:title, :link, :days, :episode, :last_title))
    @podcast.user_id = @user.id

    if @podcast.save

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "podcasts" WHERE "podcasts"."id" = ?  [["id", 6]]
---
  def destroy
    @user = current_user
    @podcast = Podcast.find(params[:id])
    @podcast.destroy

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @podcast = Podcast.find(params[:id])

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "podcasts" SET "last_title" = ?, "updated_at" = ? WHERE "podcasts"."id" = ?  [["last_title", ""], ["updated_at", 2017-02-18 17:40:03 UTC], ["id", 5]]
---
  def update
    @podcast = Podcast.find(params[:id])
    @podcast.assign_attributes(podcast_params)
    if @podcast.save

SELECT "podcasts".* FROM "podcasts" WHERE "podcasts"."user_id" = ? ORDER BY "podcasts"."updated_at" DESC  [["user_id", 6]]
---
  def schedule
    @user = current_user
    @podcasts = @user.podcasts.order(updated_at: :desc)